vetis_api/templates/vetis_api/xml/GetVetDocumentByUuid.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/"
xmlns:apldef="http://api.vetrf.ru/schema/cdm/application/ws-definitions"
xmlns:apl="http://api.vetrf.ru/schema/cdm/application"
xmlns:merc="http://api.vetrf.ru/schema/cdm/mercury/g2b/applications/v2"
xmlns:bs="http://api.vetrf.ru/schema/cdm/base"
xmlns:vd="http://api.vetrf.ru/schema/cdm/mercury/vet-document/v2"
xmlns:dt="http://api.vetrf.ru/schema/cdm/dictionary/v2">
   <soapenv:Header/>
   <soapenv:Body>
      <apldef:submitApplicationRequest>
         <apldef:apiKey>{{ vetis_request.api_key }}</apldef:apiKey>
         <apl:application>
            <apl:serviceId>{{ vetis_request.service_id }}</apl:serviceId>
            <apl:issuerId>{{ vetis_request.issuer_id }}</apl:issuerId>
            <apl:issueDate>{{ vetis_request.issue_date }}</apl:issueDate>
            <apl:data>
               <merc:getVetDocumentByUuidRequest>
         			<merc:localTransactionId>{{ vetis_request.local_transaction_id }}</merc:localTransactionId>
         			<merc:initiator>
         				<vd:login>{{ vetis_request.initiator_login }}</vd:login>
                  </merc:initiator>
                  <bs:uuid>{{ vetis_request.vet_document_uuid }}</bs:uuid>
         			<dt:enterpriseGuid>{{ vetis_request.enterprise_guid }}</dt:enterpriseGuid>
         		</merc:getVetDocumentByUuidRequest>
            </apl:data>
         </apl:application>
      </apldef:submitApplicationRequest>
   </soapenv:Body>
</soapenv:Envelope>