ArchiveCleaner/bin/Debug/1/Новая папка/CheckForCompletedOutboundOperation.xml

<?xml version="1.0"?>
<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/"
  xmlns:ws="http://api.vetrf.ru/schema/cdm/application/ws-definitions"
  xmlns:app="http://api.vetrf.ru/schema/cdm/application"
  xmlns:v2="http://api.vetrf.ru/schema/cdm/mercury/g2b/applications/v2"
  xmlns:base="http://api.vetrf.ru/schema/cdm/base"
  xmlns:v21="http://api.vetrf.ru/schema/cdm/mercury/vet-document/v2"
  xmlns:v22="http://api.vetrf.ru/schema/cdm/dictionary/v2">
  <soapenv:Header/>
  <soapenv:Body>
    <ws:submitApplicationRequest>
      <ws:apiKey>@Model.ApiKey</ws:apiKey>
      <app:application>
        <app:serviceId>@Model.ServiceId</app:serviceId>
        <app:issuerId>@Model.IssuerId</app:issuerId>
        <app:issueDate>@Model.IssueDate.ToString("yyyy-MM-ddTHH:mm:sszzz")</app:issueDate>
        <app:data>
          <v2:getStockEntryListRequest>
            <v2:localTransactionId>@Model.LocalTransactionId</v2:localTransactionId>
            <v2:initiator>
              <v21:login>@Model.Login</v21:login>
            </v2:initiator>
            <base:listOptions>
              <base:count>@Model.Count</base:count> 
              <base:offset>@Model.Offset</base:offset>
            </base:listOptions> 
            <v22:enterpriseGuid>@Model.EnterpriseGuid</v22:enterpriseGuid>
			      <v2:searchPattern>
			        <v21:blankFilter>NOT_BLANK</v21:blankFilter>
              @if (@Model.ReceiptBeginDate!=null && @Model.ReceiptEndDate!=null) {
              <v21:receiptDateInterval>
                <base:beginDate>@Model.ReceiptBeginDate.Value.ToString("yyyy-MM-ddTHH:mm:ss")</base:beginDate>
                <base:endDate>@Model.ReceiptEndDate.Value.ToString("yyyy-MM-ddTHH:mm:ss")</base:endDate>
              </v21:receiptDateInterval>               
              }
			      </v2:searchPattern>
          </v2:getStockEntryListRequest>
        </app:data>
      </app:application>
    </ws:submitApplicationRequest>
  </soapenv:Body>
</soapenv:Envelope>